{
	"noautogen":false,
	"image":"images/wbls/TNG-DigitalDashboard_HoPVizScatterPlot.jpg",
	"name":"Hands-on-Portal Visualizing Scatter Plot Webble",
	"description":"<h3>Hands-on-Portal Scatter Plot Visualization Webble for&nbsp;Digital Dashboard 3.0 TNG</h3><p>This Webble shows various types of data in a scatter plot.</p><p>It expects data to be provided by a Hands-on Portal data Webble, for example the hopFileDataWebble.</p><p>To start visualizing data, load some data (by for instance dropping a data file from the file system on the hopFileDataWebble) and then drag-and-drop the data field name you want to visualize from the list of data fields displayed by the data Webble and drop it on the area corresponding to the x-axis or the y-axis depending on where you want to see the data. The Scatter Plot Webble needs data for both the x-axis and the y-axis before it starts visualizing anything.</p><p>You can zoom the visualization with the \"z\" (zoom in) and \"x\" (zoom out) keys, or the \"+\" and \"-\" keys.</p><p>When zoomed, the view port can be panned around with either the arrow keys or with \"w\" (pan up), \"s\" (pan down), \"a\" (pan left), and \"d\" (pan right).&nbsp;</p><p>To change various options, right-click on the Webble and select \"Properties\".</p><hr /><h4>Digital Dashboard 3.0 The New Generation User Instructions</h4><p>You need to lead at least one data source Webble, normally the \"hopFileDataWebble\" Webble, and at least one visualization Webble, for&nbsp;example the \"hopVizBarChartWebble\".</p><p>No parent-child connections are needed, but commonly all visualization&nbsp;Webbles are made into children of the data source Webble if only one&nbsp;data source is used. No slot connections are necessary but connecting&nbsp;the \"ColorScheme\" slots makes sure all Webbles use the same colors<br />when visualizing the data.</p><p>Data needs to be loaded for something to happen. Data source Webbles do not generally have a data input slot, so data&nbsp;is loaded by either clicking the \"Choose File\" button, drag-and-drop<br />of a file from the file system on the Webble, or typing in a URL to a&nbsp;data file available online.</p><p>There are two ways to set up connections from the data sources to the&nbsp;visualizations, one aimed at users and one aimed at programmers. The&nbsp;first way is to drag-and-drop.</p><p>A data source Webble displays a list of data fields it has&nbsp;found. It is possible to click on one field in the list and drag it&nbsp;with the mouse to a visualization Webble. Once the mouse goes over the<br />visualization Webble, it will display whiteish areas with data input&nbsp;field names (for example \"X-axis data\"). Dropping the data field in&nbsp;one such area will set up a connection from the data field that was&nbsp;dragged to the input field it was dropped on, though nothing will&nbsp;happen if the data is of a data type that the input field does not&nbsp;accept. Most visualization Webbles also allow&nbsp;drag-and-drop from one visualization Webble to another in a similar&nbsp;way. The visualization Webbles usually display the data field name&nbsp;they received from the data source as for example an axis label, and&nbsp;it is possible to drag the axis label to another visualization Webble&nbsp;to show the same data in the other visualization.</p><p>The option to choose if having more than one selection should result&nbsp;in subsets of data in different colors or if it should just be&nbsp;selected or not has been moved to a slot on each visualization Webble. The slot is called \"MultipleSelectionsDifferentGroups\".</p><p><strong>What can you do once it is set up?</strong></p><p>Once something is visualized, interaction with the visualizations is&nbsp;possible. Normally, you click-and-drag in the visualizations to select&nbsp;subsets of data. Holding Ctrl while selecting will keep the old&nbsp;selection(s) and add a new one. Some visualization Webbles have other&nbsp;functionality too (holding SHIFT and clicking, for example).</p><p>Generally speaking, selecting data in one Webble will make all&nbsp;visualizations update, showing selected data in one color and data&nbsp;that is not selected as grey and shaded out. If some data item is \"not&nbsp;selected\" in one Webble, it will globally be considered as not&nbsp;selected, even though it may be included in some selection in another&nbsp;visualization.</p><p>You can drag-and-drop data fields from data sources and from other visualization Webbles to visualizations to set up more visualizations&nbsp;or to change what is shown. You can add more Webbles at any time.</p><p>You can load other data files at any time. If you have very large data&nbsp;files loaded, loading a new data file may lead to memory&nbsp;problems. Possibly there is a problem in the code or possibly it is<br />the garbage collection of Javascript, but you may run out of memory&nbsp;even though you should not need to.</p><p><strong>Webbles that are both data sources and visualization Webbles.</strong></p><p>Webbles can be both visualization components and data sources. One&nbsp;example is the heatmap Webble that shows data in a heatmap and can&nbsp;select subsets of data based on the heatmap but that can also generate&nbsp;\"transactions\". It generates new data that are the heatmap rows<br />remapped to vectors of 1 or 0 for \"cell currently selected\" or \"cell&nbsp;currently not selected\". The generated transactions can be used as&nbsp;input to other visualization Webbles.</p><p><strong>Data mining functionality</strong></p><p>Webbles can do other things than visualization, the most common being&nbsp;data mining.</p><p>The DigitalDashboardPluginItemSetMining Webble does item set mining&nbsp;and the mining results can be used as inputs to other visualization&nbsp;Webbles.</p><p>The heatmap Webble does clustering of rows and columns. It also&nbsp;generates transactions for the DigitalDashboardPluginItemSetMining to&nbsp;do item set mining on.</p><p><strong>Supported data formats</strong></p><p>The file loadind data Webble supports the following file formats:</p><ul><li>CSV style files, text files with rows of data where each column is&nbsp;separated by commas. The columns can also be separated by TABs or by&nbsp;SPACEs. The rows can be separated by newlines or by semicolons. The&nbsp;first row can have column names.</li><li>Rockstar files. Rockstar is a binary format used in astrophysics.</li><li>GrADS files. GrADS is a binary format used for grid type numerical&nbsp;data. Expects one or more binary files and one control (metadata)&nbsp;file.</li><li>NetCDF files. A standard format similar to GrADS.</li><li>The binary file format for density data used by the Yoshida group.</li><li>The binary file formats used for inundation data and for building<br />damage data by the Koshimura group.</li><li>JSON files. The JSON format is kind of supported. JSON files can be<br />read but the data need to be formatted so the Webble understands the<br />data.</li><li>Zip archives. Any of the supported files above can be put into a zip<br />archive and it will still work. Currently, archives with more than one<br />file may not work.</li><li>lzh archives. Same restrictions as for zip files.</li><li>gzip archives. Same restrictions as for zip files.</li></ul>",
	"keywords":"Digital Dashboard, Hands-on Portal, hop, dashboardTNG, visualization, viz",
	"author":"digitalDashboardTNG"
}
