{
	"noautogen":false,
	"image":"images/wbls/digitalDashboard.png",
	"name":"DigitalDashboard",
	"description":"<h3>The Digital Dashboard super parent Webble</h3><p><span style=\"color: #ff0000;\">This is the old (Legacy) version of the \"Digital Dashboard\" for data visualization.</span><br /><span style=\"color: #ff0000;\">Legacy Dashboard 2.0 Webbles are about to be deprecated in favour of Dashboard 3.0 TNG (The New Generation) Webbles, so if you have a choice, please use the new version instead.</span></p><h3><strong><u>OVERVIEW</u></strong></h3><p>Connect Digital Dashboard data Webbles and visualization Webbles to this Webble as children, and the Digital Dashboard super parent Webble will coordinate between them. When selections are made in one child Webble, the parent will inform all visualization components that they may need to redraw etc.</p><h3><strong><u>HOW TO SET UP</u></strong></h3><p>The Legacy Digital Dashboard components expect to be connected in specific ways. This is how you set it up.<br />The component called \"Digital Dashboard Master\" is expected to be loaded and to be the parent of all other components.<br />At least one data loading component is needed. Usually the \"Digital Dashboard Smart Data Source\" is a good choice since it can read several common formats. Load this (or some other data component) and connect it as a child of the DigitalDashboard by right-clicking on the Digital Dashboard Smart Data Source, selecting \"add parent\" and then clicking on the Digital Dashboard Master component.</p><p>The data components load data in various formats and then present them to the other components in a standard format so no other component needs to know what the original format of the data may have been. You can connect more than one data component and use data from several components at once.</p><p>To make something interesting happen, at least one visualization component is also needed, for example the&nbsp;\"Digital Dashboard Plugin Scatter Plot\". These components should also be&nbsp;connected to the DigitalDashboard as child components (just like the&nbsp;data component above).</p><h3><strong><u>HOW TO LOAD DATA</u></strong></h3><p>Data files from the local system can be loaded by using drag&amp;drop (dropping files on the \"drop data here\" part of the data component), clicking \"load file\" and browsing to the file, etc. Some components also allow you to copy-paste data or type data manually directly into a slot (no file needed).</p><h3><strong><u>HOW TO SEND DATA TO VISUALIZATION COMPONENTS</u></strong></h3><p>Once at least one data component is connected to the Digital Dashboard Master, that component has data loaded, and at least one visualization component is also connected to the Digital Dashboard Master, data can be visualized.</p><p>One way to choose what data to visualize in which component is to right-click on the Digital Dashboard Master and choose either of the menu options 'Data -&gt; Visualizations' or 'Visualizations -&gt; Data'. A window opens where each visualization component is listed with the inputs it expects before it can start visualizing.&nbsp;</p><p>Some components have different sets of data they can display. For&nbsp;example the Digital Dashboard Plugin Bar Chart can visualize data with&nbsp;only one input (for example a set of numerical data) or visualize data&nbsp;with two inputs (one set with the values, one set with the weights to&nbsp;give each of the values). If more than one such set is filled with&nbsp;information on what data to use, the first set will be used.</p><p>Each input field can be set to one output field from some data source&nbsp;component. Only fields with matching data types can be selected.</p><p>Once a visualization component has one of its sets of inputs it needs&nbsp;filled with output fields from some data component (normally, all&nbsp;fields should/must be from the same data component, though there are&nbsp;exceptions), the data will be visualized once the form is closed.</p><p>Some data components and some visualization components also support&nbsp;drag&amp;drop of data fields to connect data component outputs to<br />visualization component inputs. To do this, click and then drag on&nbsp;field name in the list of data output fields displayed by the data&nbsp;component. Once this is dragged over the visualization component to&nbsp;connect to, the visualization component will display different areas to drop the field name in to connect it to different input fields. If&nbsp;the data types do not match, no connection will be made, though.</p><h3><strong><u>HOW TO INTERACT WITH THE SYSTEM</u></strong></h3><p>Once data is visualized, it is possible to select subsets of data and compare them to each other etc. Most components allow you to click-and-drag in the visualization to select data. Most components will remove any old selections and make a new selection if you click-and-drag and they will keep the old selections and add one more selection if you hold Ctrl while you click-and-drag.&nbsp;</p><p>What happens when there is more than one selection can be set to&nbsp;treating data as either selected or not-selected, or to display data&nbsp;in the different selections in different colors. This is changed using&nbsp;the 'Data -&gt; Visualizations' menu above, where there is a checkbox for&nbsp;each component to choose if several selection lead to different colors&nbsp;or not.</p><p>Most components have many options to change the look or&nbsp;behavior. Right-click on a visualization component and open the&nbsp;\"Properties\" to see the options available. For the&nbsp;Digital Dashboard Plugin Scatter Plot it is for example possible to change&nbsp;the size of the dots in the plot.</p>",
	"keywords":"DigitalDashboard",
	"author":"legacyDigitalDashboard"
}
